# The script of the game goes in this file.

# Declare characters used by this game. The color argument colorizes the
# name of the character.

define e = Character("เอกพล")
define b = Character("???")
define a = Character("[name]")
define c = Character("เด็ก")
define d = Character("คุณน้า")
define o = Character("อลิสา")


# ปรับขนาดภาพ
image รินชุดนักเรียน= im.FactorScale("รินชุดนักเรียน.png", 0.65)
image ห้องเรียน = im.Scale("ห้องเรียน.png",1920,1080)
image สนามกีฬาในวันที่ฝนตก = im.Scale("สนามกีฬาในวันที่ฝนตก.png",1920,1080)
image โรงเรียน = im.Scale("โรงเรียน.png",1920,1080)
image โรงยิม = im.Scale("โรงยิม.png",1920,1080)
image ทางเดินไปโรงเรียน = im.Scale("ทางเดินไปโรงเรียน.png",1920,1080)
image ห้องนอนตอนเช้า = im.Scale("ห้องนอนตอนเช้า.png",1920,1080)
image ถนน = im.Scale("ถนน.png",1920,1080)
image เอกพลปกติ = im.FactorScale("เอกพลปกติ.png",0.29)
image อริสาปกติ = im.FactorScale("อริสาปกติ.png",0.9)
image อริสายิ้ม = im.FactorScale("อริสายิ้ม.png",0.9)
image อริสาหลับตายิ้ม = im.FactorScale("อริสาหลับตายิ้ม.png",0.9)
image อริสาหลับตายิ้มv1 = im.FactorScale("อริสาหลับตายิ้มv1.png",0.9)
image อลิสาหลับตา = im.FactorScale("อลิสาหลับตา.png",0.9)
image อลิสาเขิน = im.FactorScale("อลิสาเขิน.png",0.9)
image ตกใจ = im.FactorScale("ตกใจ.png",0.29)
image งง = im.FactorScale("งง.png",0.29)
image มีความสุข = im.FactorScale("มีความสุข.png",0.29)
image โกรธ = im.FactorScale("โกรธ.png",0.29)
image สบายใจ = im.FactorScale("สบายใจ.png",0.29)
image อริสาcg = im.Scale("อริสาcg.png",1920,1080)
image อริสายิ้มcg = im.Scale("อริสายิ้มcg.png",1920,1080)
# The game starts here.

label start:

    
    #play sound"เสียงคีบอด.mp3" volume 1
    #b "{cps=20}ในวันนั้น...ก็เหมือนวันปกติทั่วไป แต่...ใครจะไปคิดว่ามันจะเกิดเรื่องที่เปลี่ยนชีวิตผมไปตลอดกาล\nมันกลายเป็นช่วงเวลาชีวิตที่ผมจะไม่มีวันลืมมันไปตลอดกาล{cps=-1}"

    play sound"1.mp3"
    b "{cps=20}บางครั้ง...คำว่าโชคชะตา...มันก็อาจจะฟังดูตลก...แต่สำหรับตัวผมแล้ว{cps=-1}"
    play sound"2.mp3"
    b "{cps=20}มันเป็นตลกที่ร้ายมากๆเลยหละ{cps=-1}"
    play sound"3.mp3"
    b "{cps=20}ในวันนั้น เมื่อหกปีก่อน... ผมกลับจากโรงเรียนประถมแล้วออกไปรอรับคุณพ่อกับคุณแม่พร้อมกับคุณน้า...{cps=-1}"
    c "{cps=20}คุณน้าฮะ! เมื่อไหร่คุณพ่อกับคุณแม่จะกลับอะ{cps=-1}"
    d "{cps=20}น่าจะได้เวลากลับแล้วมั้งนะ{cps=-1}"
    play sound"4.mp3"
    b "{cps=20}คุณน้าตอบผมพร้อมกับพยายามมองหาคุณพ่อกับคุณแม่...{cps=-1}"
    play sound"5.mp3"
    b "{cps=20}ไม่นานนัก ก็พบท่านทั้งสองกำลังโบกมือให้พวกเราอยู่ คุณน้าชี้มือไปทางคุณพ่อกับคุณแม่เรียกให้ผมหันไป{cps=-1}"
    c "{cps=20}อ้ะ! พ่อฮะ แม่ฮะ! ผมอยู่ทางนี้ฮะ!!{cps=-1}"
    play sound"6.mp3"
    b "{cps=20}ผมตะโกนเรียกเสียงดังพร้อมกับโบกมือให้ ทั้งสอนคนก็ยิ้มให้กับผมพร้อมกับโบกมือตอบ... แต่ทว่า{cps=-1}"
    "..."
    play sound"7.mp3"
    "{cps=20}เอี๊ยดดดด!!! โครมมม!{cps=-1}"
    play sound"8.mp3"
    b "{cps=20}ราวกับเสียงคมเคียวยมทูตที่กรีดร่างคุณพ่อกับคุณแม่ ภาพร้อยยิ้มของพวกท่านที่กำลังโบกมือให้กับผม...คือภาพสุดท้ายที่ผมได้เห็น...{cps=-1}"
    play sound"เฮ้อ.mp3"
    b "{cps=20}เฮือกกกก...!! ภาพของเพดานห้องที่อยู่ในความืดมิด ปรากฏขึ้นต่อหน้าสายตาที่พร่ามัวของผม{cps=-1}"
    b "{cps=20}หยาดน้ำใสๆ ไหลรินลงมาจากดวงตาไม่หยุด ผมค่อยๆ พยุงร่างลุกขึ้นนั่งช้าๆ\n พลางใช้สองมือเช็ดน้ำตาให้หยุดไหล{cps=-1}"
    b "{cps=20}ภาพเหตุการณ์ในวันนั้น ย้อนกลับมาอีกครั้ง{cps=-1}"
    b "{cps=20}ภาพของคนสำคัญของผมทั้งสองคน ที่จากไปอย่างไม่มีวันกลับด้วยอุบัติเหตุ{cps=-1}"
    b "{cps=20}รถยนต์ที่กำลังขับมาเกิดเสียหลักจากการที่ถนนลื่น{cps=-1}"
    b "{cps=20}พุ่งเข้าชนร่างคุณพ่อกับคุณแม่ของผมที่กำลังยืนรอสัญญานไฟคนข้ามอยู่ ภาพเหตุการณ์ในวันนั้น{cps=-1}"
    b "{cps=20}ยังคงเป็นฝันร้ายตามวนเวียนหลอกหลอนผมอยู่จนกระทั้งทุกวันนี้{cps=-1}"
    b "{cps=20}แม้ว่าทุกคนจะบอกให้ผมทำใจและลืมเรื่องในวันนั้นไปให้ได้{cps=-1}"
    b "{cps=20}แต่ไม่ว่ายังไง ผมก็ทำไม่ได้สักที{cps=-1}"
    b "{cps=20}ผมลุกขึ้นยืนช้าๆ สองเท้าค่อยๆ พาร่างของตัวเองไปยังห้องน้ำอย่างไร้เรี่ยวแรง{cps=-1}"
    play sound"เสียงอาบน้ำ.mp3"
    b "{cps=20}เสียงของสายน้ำ ดังข้นมาทำลายความเงียบ{cps=-1}"
    b "{cps=20}ภาพสะท้อนของเด็กหนุ่มในกระจกแสดงสีหน้าที่ยากจะบรรยายได้ว่ากำลังรู้สึกอย่างไร{cps=-1}"
    stop sound fadeout 1.0
    b "{cps=20}และนั้นก็คือตัวผมเอง...{cps=-1}"
    play sound"ไหนว่าจะเข้มแข็งขึ้นให้ได้ไง.mp3"
    b "{cps=20}ไหนว่าจะเข้มแข็งขึ้นให้ได้ไง...{cps=-1}"
    b "{cps=20}ผมบอกกับตัวเองครั้งที่เท่าไหร่แล้วก็ไม่รู้{cps=-1}"
    play sound"น่าทุเรศชะมัด.mp3"
    b "{cps=20}น่าทุเรศชะมัด{cps=-1}"
    b "{cps=20}ใช่แล้ว น่าทุเรศที่สุด ผมสัญญาต่อหน้าภาพของคุณพ่อคุณแม่หลังจากวันนั้นว่า{cps=-1}"
    b "{cps=20}ผมจะต้องเข้มแข็งขึ้น ต้องเป็นลูกผู้ชายที่เข้มแข็ง{cps=-1}"
    b "{cps=20}และจะต้องอยู่ด้วยกำลังของตัวเองให้ได้{cps=-1}"
    b "{cps=20}แต่สุดท้าย... แค่ภาพฝันร้ายตามมาหลอกหลอนอีกครั้ง ก็ยังร้องไห้ง่ายๆ เหมือนเดิมทุกที...{cps=-1}"
    play sound"จะลืมได้สักที.mp3"
    b "{cps=20}เมื่อไหร่ ถึงจะลืมได้สักทีนะ... ไอ้บ้าเอ้ย{cps=-1}"
    b "{cps=20}ผมยกสองมือขึ้นแล้วกวักน้ำจากก๊อกขึ้นมาล้างหน้าหลายครั้ง{cps=-1}"
    b "{cps=20}แล้วยกผ้าขนหนูขึ้นมาเช็ดใบหน้าเบาๆ{cps=-1}"
    b "{cps=20}ภาพของตัวเองที่สะท้อนขึ้นในกระจกเริ่มจะดูดีขึ้นมานิดหน่อยละมั้งนะ{cps=-1}"
    play sound"9.mp3"
    b "{cps=20}ต้องเข้มแข็งขึ้นให้ได้สักวันละนะ ฮะฮะ{cps=-1}"
    b "{cps=20}ผมคิดอย่างนั้นจริงๆ นะ...{cps=-1}"
    "{cps=20}7.00 น.{cps=-1}"
    $ name = renpy.input("โปรดใส่ชื่อตัวละคร ปล.ตัวครในเกมส์ชื่อรินหากอยากอินให้ตั้งตาม")
    $ name = name.strip()
    scene ห้องนอนตอนเช้า
    play sound"เอก1.mp3"
    b "{cps=20}ริน!! รินว้อยยย!! ตื่นยางงงง?{cps=-1}"
    a "{cps=20}เสียงโหวกเหวกน่ารำคาญที่ดังอยู่หน้าบ้านของผมในเวลานี้ ไม่ใช่เสียงของใครที่ไหน{cps=-1}"
    a "{cps=20}เสียกของไอ้บ้าเอก เอกพล ศักดิ์สุภกานต์ เพื่อนสนิทตั่งแต่เด็กของผมนั้นเอง...{cps=-1}"
    a "{cps=20}เอ... จะเรียกว่าสนิทที่สุดก็คงจะได้มั้ง เพราะผมเป็นคนมนุษย์สัมพันธ์ค่อนข้างแย่{cps=-1}"
    a "{cps=20}เลยทำให้มีเพื่อนสนิทจริงๆน้อยมาก และเพื่อนๆส่วนใหญ่ พอขึ้นชั้น มอปลาย\n ก็แยกย้ายกันไปเรียนที่อื่นกันหมด{cps=-1}"
    a "{cps=20}เหลือแต่ไอ้บ้าเอกนี้คนเดียวเท่านั้น จะเรียกว่าโชคร้ายหรือโชคดีกันนะเนี่ย...{cps=-1}"
    play sound"ไอ้บ้าริน.mp3"
    e "{cps=20}ไอ้บ้าริน!! จะโผล่หัวลงมาได้รึยังเนี่ย!!{cps=-1}"
    "{cps=20}โครมมมม!!!{cps=-1}"
    play sound"เอกเฮ้ย.mp3"
    e "{cps=20}เฮ้ยยย!!!{cps=-1}"
    a "{cps=20}ผมโยนรองเท้านักเรียนเก่าที่เล็กจนใส่ไม่ได้แล้วลงจากหน้าต่างแทนคำตอบ...{cps=-1}"
    play sound"โยนร้องเท้า.mp3"
    e "{cps=20}ไอ้บ้านี่! เรียกดีๆ ทำไมต้องโยนรองเท้าใส่ฟะ!{cps=-1}"
    a "{cps=20}ก็มันหนวกหูไง เลยจะทำให้เงียบ... แต่ดูเหมือนจะได้ผมตรงกันข้ามเลยนะเนี่ย{cps=-1}"
    play sound"โผล่หัว.mp3"
    e "{cps=20}รีบๆ โผล่หัวลงมาไวๆ เลยไอ้บ้าเอ้ย!{cps=-1}"
    play sound"รอยู่ตรงนั้น.mp3"
    a "{cps=20}เออๆ รู้แล้วน่า รออยู่ตรงนั้นแล้วกัน{cps=-1}"
    a "{cps=20}ผมตอบไปด้วยน้ำเสียงปนรำคาญเล็กน้อย\n ก่อนจะหยิบรองเท้านักเรียนขึ้นมาแล้วเดินลงบันไดไปชั้นล่าง{cps=-1}"
    a "{cps=20}ระหว่างที่ผมกำลังสวมรองเท้าอยู่นั้น คุณน้าก็ชะโงกหน้าออกมาจากห้องนั่งเล่นเพื่อมองส่งผม{cps=-1}"
    play sound"ไปก่อนนะครับ.mp3"
    a "{cps=20}ไปก่อนนะครับ{cps=-1}"
    a "{cps=20}ผมบอกเธอแค่นั้น แล้วก็ลุกขึ้นเปิดประตูออกไป{cps=-1}"


    play sound"เสียงเปิดประตู.mp3"

    play music "เพลงประกอบ1.ogg"volume 0.5
    scene ทางเดินไปโรงเรียน
    show เอกพลปกติ with easeinright
    play sound"10.mp3"
    e "{cps=20}กว่าจะออกมาได้นะนายนะ เล่นเอาเกือบสายเลยนะเฮ้ย{cps=-1}"
    play sound"11.mp3"
    a "{cps=20}แล้วมันสายรึยังหละ บ้านก็อยู่ไกล้โรงเรียนแบบนี้ เดินไป10นาทีก็ถึง รีบแบบมาตั้งแต่7โมง\n เช้าแบบนี้ เป็นกระต่ายรึไง?{cps=-1}"
    show งง
    play sound"12.mp3"
    e "{cps=20}แล้วกระต่ายมันเกี่ยวอะไรด้วยวะ{cps=-1}"
    play sound"13.mp3"
    a "{cps=20}ก็กระต่ายตื่นตูมไง ต้องตื่นตูมรีบไปก่อนชาวบ้านเขาเสมอนะ{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"14.mp3"
    e "{cps=20}เขาไม่ได้เรียกตื่นตู้มว้อย! เขาเรียกว่าเตรียมพร้อมต่างหาก รีบไปแต่เช้า คนจะได้ไม่เยอะ\n อุตส่าเริ่มต้นเช้าวันแรกของการเป็นนักเรียน ม.ปลาย ทั้งที จะไปสายให้มันได้อะไรขึ้นมาวะ{cps=-1}"
    play sound"15.mp3"
    a "{cps=20}ทั้ง ๆ ที่บ้านอยู่ไกล้โรงเรียนมากกว่าฉันอีกเนี่ยนะ?{cps=-1}"
    play sound"16.mp3"
    e "{cps=20}ก็แค่กลัวว่านายจะไปสายไง ยิ่งขุดออกจากที่นอนยากๆ อยู่{cps=-1}"
    play sound"17.mp3"
    a "{cps=20}มันจะขุดออกจากที่นอนยากก็เพราะนายนั้นล่ะ ตื่นเต้นจนนอนไม่หลับ ก็เลยโทรมาชวนชั้นคุยตอนตี 1 เนี่ย...{cps=-1}"
    hide เอกพลปกติ
    show งง
    play sound"18.mp3"
    e "{cps=20}เรื่องนั้นก็ส่วนเรื่องนั้น เรื่องนี้ก็ส่วนเรื่องนี้สิวะ{cps=-1}"
    play sound"19.mp3"
    a "{cps=20}แต่ว่าสาเหตุมันมาจากนายนะ...{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"20.mp3"
    e "{cps=20}ไม่รู้ว้อย รีบไปเหอะ!{cps=-1}"
    hide เอกพลปกติ with Dissolve(1.0)

    "{cps=20}พอเถียงแพ้แล้วมันก็เปลี่ยนเรื่องซะอย่างนั้น ช่างเถอะ ผมเองก็ชินกับนิสัยของมันแล้วเหมือนกัน{cps=-1}"
    "{cps=20}ผมสายหัวเบาๆ ก่อนจะเร่งฝีเท้าเดินตามหลังมันไป{cps=-1}"

    scene ถนน with Dissolve(1.0)
    show มีความสุข with easeinright
    play sound"21.mp3"
    e "{cps=20}จะว่าไป วันนี้ก็อุตส่าห์ได้เป็นนักเรียนมอปลายวันแรกแล้วทั้งทีนายว่า...มันจะมีเรื่องดีๆ\n เกิดขึ้นเกิดขึ้นมั้งมะ?{cps=-1}"
    play sound"22.mp3"
    a "{cps=20}เรื่องดี ๆ อะไรของนายล่ะ?{cps=-1}"
    play sound"23.mp3"
    e "{cps=20}ก็อย่างเช่น การพบเจอกันแห่งโชคชะตา มีสาวงามวิ่งมาชนที่ตรงหัวมุม แล้วก็...ปิ๊ง!!\n ตกหลุมรักตั่งแต่แรกพบไง{cps=-1}"
    play sound"24.ogg"
    a "{cps=20}ละเมออะไรรึเปล่าวะเอก?{cps=-1}"
    hide มีความสุข
    show เอกพลปกติ
    play sound"25.mp3"
    e "{cps=20}ละเมอบ้านแกสิ เรื่องแบบนี้ ไม่เชื่อก็อย่าลบหลู่สิว้อย{cps=-1}"
    play sound"26.mp3"
    a "{cps=20}มันใช่เรื่องสิ่งศักดิ์สิทธิ์ที่ไหนกันหา แล้วก็นะ\n ไอ้พล็อตเรื่องการ์ตูนตาหวานแบบนั้นจะเกิดขึ้นได้ง่ายๆ รึไงกัน{cps=-1}"
    hide เอกพลปกติ
    show งง
    play sound"27.mp3"
    e "{cps=20}มันอาจจะมีก็ได้นะ{cps=-1}"
    play sound"28.mp3"
    a "{cps=20}ไอ้เรื่องบุพเพอาละวาดเนี่ย ขอทีเหอะว่ะ ไร้สาระเป็นบ้าเลย{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"29.mp3"
    e "{cps=20}ไร้สาระบ้านแกสิ!{cps=-1}"
    play sound"30.mp3"
    a "{cps=20}โลกใบนี้มันมีประชากรกี่แสนล้านคน คิดว่าเนื้อคู่ของนายมันจะหาเจอได้ง่ายดายขนาดนั้นเลยรึไง?{cps=-1}"
    play sound"31.mp3"
    e "{cps=20}ถ้ามีความเชื่อซะอย่าง อะไรก็ไปถึงได้ไม่ใช่รึไงกัน ดูอย่างดวงจันทร์หรืออวกาศดิ\n มนุษย์ยังไปถึงแล้วเลย เรื่องแค่นี้ ทำไมมันจะทำไม่ได้ฟะ?{cps=-1}"
    play sound"32.mp3"
    a "{cps=20}มันไม่ใช่เรื่องที่แค่เชื่ออย่างเดียวแล้วมันจะทำได้นะเฮ้ย...{cps=-1}"
    play sound"33.mp3"
    e "{cps=20}ถ้านายไม่เชื่อ ก็อย่ามาบั่นทอนกำลังใจชาวบ้านเขาสิฟะ{cps=-1}"
    play sound"34.mp3"
    a "{cps=20}เอาเป็นว่า ถ้านายจะพล่ามเรื่องพรรค์นี้นะเอก ฉันว่านายเอาเวลาไปเรียนหนังสือดีกว่าไหม{cps=-1}"
    play sound"35.mp3"
    a "{cps=20}แค่สอบเข้าเรียนที่นี่ได้ ไม่ได้หมายความว่าจะทำคะแนนได้ง่ายๆนะ เดี๋ยวถ้าเกรดตกอีก\n นายก็โดนแม่ตัดค่าขนมอีกหรอก{cps=-1}"
    hide เอกพลปกติ
    show สบายใจ
    play sound"36.mp3"
    e "{cps=20}ไม่ต้องห่วง ชั้นมีมาตราการรับมือกับสถานการณ์ฉุกเฉินแบบนี้อยู่แล้ว{cps=-1}"
    play sound"37.mp3"
    a "{cps=20}อะไรล่ะ?{cps=-1}"
    hide สบายใจ
    show มีความสุข
    play sound"38.mp3"
    e "{cps=20}อัจฉริยะข้ามคืนไงละ!{cps=-1}"
    play sound"39.mp3"
    a "{cps=20}ขอให้สอบมิดเทอมนายตกรวดเลยก็แล้วกัน...{cps=-1}"

    "{cps=20}ผมส่ายหน้าเบาๆ อย่างอ่อนใจ คิดง่ายเกินไปแล้วไอ้เพื่อนคนนี้{cps=-1}"
    "{cps=20}ถ้าการอ่านหนังสือสอบก่อนหน้าจะสอบแค่วันเดียวมันทำให้คนกลายเป็นอัจฉริยะขึ้นมาได้{cps=-1}"
    "{cps=20}ป่านนี้ อัลเบิร์ต ไอน์สไตน์ คงเกลื่อนโลกไปแล้วล่ะ...{cps=-1}"

    scene โรงเรียน with Dissolve(1.0)
    "{cps=20}หลักจากคุยกันเรื่อยเปื่อยแล้ว ผมกับเอก ก็ออกเดินกันไปเรื่อยๆ{cps=-1}"
    "{cps=20}ผ่านทางขึ้นเนินที่เป็นทางตรงไปยังหน้าโรงเรียน{cps=-1}"
    "{cps=20}สองข้างทางเต็มไปด้วยต้นหูกวางที่ในช่วงเวลานี้ ใยของมันเป็นสีเขียวสดใส\n อันเป็นสีประจำฤดูร้อน...{cps=-1}"
    play sound"40.mp3"
    e "{cps=20}เฮ้ย! ริน ดูนั่น!!{cps=-1}"
      "{cps=20}จู่ๆ เจ้าเอกก็หยุดเดินพร้อมกับชี้ไปมือไปข้างหน้า...{cps=-1}"
    stop music


    play music "lovesong.ogg"
    scene อริสาcg with Dissolve(1.0)
    "{cps=20}ภาพของเด็กสาวคนนึงที่ยืนอยู่หน้าประตูโรงเรียน\n ทำเอาผมกับเจ้าเอกตกตะลึงไปชั่วขณะนึงเลยทีเดียว...{cps=-1}"
    play sound"41.mp3"
    a"{cps=20}ดวงตาสีฟ้าครามกับเส้นผมสีบลอนด์ทองสว่างสดใส ผิวขาวราวกับหิมะแรกของฤดูหนาวนั่น...{cps=-1}"
    play sound"42.mp3"
    e "{cps=20}เฮ้ยๆ!! เดี๋ยวๆๆ อย่าพึ่งเพ้อสิเฮ้ย!{cps=-1}"
    play sound"43.mp3"
    a "{cps=20}ห๊ะ!? อะไรนะ?{cps=-1}"
    play sound"44.mp3"
    e "{cps=20}นายหลุดออกมาหมดแล้ว... อะไรกันๆ เจอแบบนี้เข้าไป ถึงกับจิตหลุดเลยเรอะนายน่ะ...{cps=-1}"
    play sound"45.mp3"
    a "{cps=20}มะ ไม่ใช่หรอกน่า... ก็แค่เผลอน่ะ{cps=-1}"
    play sound"46.mp3"
    e "{cps=20}เอาน่าๆ ฉันเข้าใจ คุณเธอเล่นสวยซะขนาดนั้น เป็นใครก็จิตหลุดได้ง่ายๆ เหมือนกันล่ะวะ{cps=-1}"
    play sound"47.mp3"
    a "{cps=20}ฮะฮะฮะ{cps=-1}"
    "{cps=20}ผมรีบหัวเราะกลบเกลื่อนไป แต่ว่าสายตาของผมนั้น\n ยังถูกภาพของเด็กสาวคนนั้นสะกดเอาราวกับต้องมนต์{cps=-1}"

    scene โรงเรียน with Dissolve(1.0)
    "{cps=20}เจ้าเอกยกมือขึ้นแล้วฟาดไปที่หัวไหล่ผมแรงๆ ทีหนึ่งเพื่อเรียกสติ{cps=-1}"
    play sound"48.mp3"
    e"{cps=20}พอได้แล้วไอ้บ้า ไปจ้องเขาขนาดนั้นมันเสียมารยาทนะว้อย{cps=-1}"
    play sound"49.mp3"
    a "{cps=20}อะ อืม... โทษที ๆ{cps=-1}"
    play sound"50.mp3"
    e "{cps=20}ไปกันได้แล้ว เดี๋ยวก็สายจนได้{cps=-1}"
    play sound"52.ogg"
    a "{cps=20}อื้ม{cps=-1}"
    "{cps=20}ผมตอบได้แค่นั้น เอกเดินไปข้างหลังผมแล้วออกแรงผลักหลังผมอย่างแรง ๆ อีกทีหนึ่ง\n แล้วออกวิ่งนำหน้าไปก่อน{cps=-1}"
    "{cps=20}ผมจึงต้องออกเดินไปทางหน้าประตูโรงเรียนอย่างช่วยไม่ได้{cps=-1}"
    "{cps=20}ระหว่างที่ผมกำลังเดินผ่านเธอเพื่อเข้าประตูโรงเรียนไปนั้น{cps=-1}"
    play sound"53.mp3"
    b "{cps=20}คิกๆ{cps=-1}"
    "{cps=20}เสียงหัวเราะเบาๆ ของเธอ ดังแว่วมากระทบโสตประสาทของผม{cps=-1}"
    "{cps=20}ผมจึงรีบหันไปมองหน้าเธอทันที{cps=-1}"
    "{cps=20}เด็กสาวที่ยืนอยู่หน้าประตูนั่น ในเวลานี้หันมายิ้มให้กับผมอย่างอ่อนโยน{cps=-1}"
    #เสียง
    scene อริสายิ้มcg with Dissolve(1.0)
    play sound"54.mp3"
    b "{cps=20}แล้วเจอกันใหม่นะคะ{cps=-1}"
    "{cps=20}เสียงกระซิบของเธอดังแว่วมา{cps=-1}"
    "{cps=20}ไม่นานนัก เธอก็เดินจากไป{cps=-1}"
    scene โรงเรียน with fade
    "{cps=20}นี้ผมฟังไม่ผิดใช่ไหมเนี่ย!? เธอบอกว่าไว้เจอกันใหม่ด้วย!!{cps=-1}"
    "{cps=20}ผมยืนนิ่งค้างอยู่อย่างนั้นอยู่เนิ่นนาน{cps=-1}"
    "{cps=20}เจ้าเอกที่เดินล่วงหน้าไปก่อนแล้วหันกลับมาพร้อมกับทำหน้านิ่งใส่{cps=-1}"
    show เอกพลปกติ with Dissolve(1.0)
    play sound"55.mp3"
    e "{cps=20}เป็นบ้าอะไรของนายอีกเนี่ย ไปเรียนได้แล้วโว้ย!!{cps=-1}"
    "..."
    play sound"57.mp3"
    e "{cps=20}อะไรเนี่ย ทำหน้ายังกะคนกำลังมีความรัก มีเรื่องอะไรดีๆ เกิดขึ้นรึไง?{cps=-1}"
    play sound"58.mp3"
    a "{cps=20}เอก...{cps=-1}"
    play sound"59.mp3"
    a "{cps=20}ชั้นอาจจะเริ่มเชื่อขึ้นมานิดๆ แล้วล่ะ{cps=-1}"
    hide เอกพลปกติ
    show งง
    play sound"60.mp3"
    e "{cps=20}หา...!? เชื่อ??? เชื่ออะไรวะ?{cps=-1}"
    play sound"61.mp3"
    a "{cps=20}ว่าเรื่องบุพเพสันนิวาศ อาจเป็นเรื่องจริงก็ได้...{cps=-1}"
    hide งง with Dissolve(1.0)
    stop music
    scene โรงยิม with Dissolve(1.0)
    "{cps=20}หลังจากการเรียนเขียนโปรแกรมครั้งแรกจบลง ผมมองออกไปด้านอกหอประชุมด้วยสีหน้าเรียบเฉย{cps=-1}"
    "{cps=20}แสงแดดยามบ่ายแม้จะไม่จัดมากเพราะเมฆค่อนข้ามครึ้ม{cps=-1}"
    "{cps=20}แต่อากาศกลับร้อนจนชวนให้หงุดหงิดเลยทีเดียว{cps=-1}"
    show งง with Dissolve(1.0)
    play sound"62.mp3"
    e "{cps=20}คิดว่านี่มันเดือนอะไรกันนะ ทำไมมันร้อนได้ร้อนดีแบบนี้ฟะ{cps=-1}"
    play sound"63.mp3"
    a "{cps=20}ประเทศนี้มันก็ร้อนแบบนี้นั้นล่ะ นายไม่เคยได้ยินหรือไง เมืองไทยมีอยู่ 3 ฤดู ฤดูร้อน ฤดูร้อนมาก\n ฤดูร้อนสุดๆ นะ{cps=-1}"
    play sound"64.mp3"
    e "{cps=20}บางทีมันก็ร้อนเกินไปนะ{cps=-1}"
    play sound"65.mp3"
    a "{cps=20}เรื่องมากชะมัด... เมื่อเช้าชั้นนั่งดูข่าวพยากรณ์อากาศ เห็นว่าวันนี้ฝนจะตกช่วงเย็นนะ{cps=-1}"
    play sound"66.mp3"
    e "{cps=20}ไอ้ที่พยากรณ์สิบครั้ง ถูกแค่ครั้งเดียวเนี่ยนะ...{cps=-1}"
    play sound"67.mp3"
    a "{cps=20}อย่างน้อยมันก็ยังถูกใช่มั้ยละ?{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"68.mp3"
    e "{cps=20}ถ้าความเห็นไม่ตรงกันแบบนี้ การพนันก็ต้องบังเกิดละครับพี่น้องคร๊าบ{cps=-1}"
    play sound"69.mp3"
    a "{cps=20}ได้เสียดิ พนันด้วยอะไรดีล่ะ?{cps=-1}"
    hide เอกพลปกติ
    show มีความสุข
    play sound"70.mp3"
    e "{cps=20}ก๋วยเตี๋ยวป้านิดสุดแหล่มข้างตลาดมะ?{cps=-1}"
    play sound"71.mp3"
    a "{cps=20}จัดไป อย่าให้เสีย{cps=-1}"
    hide มีความสุข
    show เอกพลปกติ
    play sound"72.mp3"
    e "{cps=20}งั้นชั้นให้นายเลิกก่อนเลยริน ว่าจะเลือกอันไหน?{cps=-1}"
    menu:
        "แน่นอน ต้องเลือกฝนตกอยู่แล้วสิ":
            jump iwant
        "หึหึหึ ตกก็บ้าแล้ว ร้อนขนาดนี้":
            jump intwant
label iwant:
    play sound"73.mp3"
    a "{cps=20}แน่นอน ต้องเลือกฝนตกอยู่แล้วสิ{cps=-1}"
    play sound"74.mp3"
    e "{cps=20}หึหึหึ แกคิดว่าฝนมันจะตกง่ายขนาดนั้นรึไง{cps=-1}"
    play music"ฝนตก.mp3"volume 5
    "....."
    scene สนามกีฬาในวันที่ฝนตก
    show ตกใจ
    play sound"75.mp3"
    e "{cps=20}แว๊ก!!! ฝนตก{cps=-1}"
    play sound"76.mp3"
    e "{cps=20}เฮ้ยๆ! เมื่อกี้ไม่นับนะ ไม่นับนะว้อยยย!!{cps=-1}"
    jump gym_scene
label intwant:
    a "{cps=20}หึหึหึ ตกก็บ้าแล้ว ร้อนขนาดนี้{cps=-1}"
    e "{cps=20}อ้าว! กลับคำเร็วเป็นบ้าเลยนะ นายเนี่ยริน{cps=-1}"

label gym_scene:
    hide ตกใจ
    play sound"77.mp3"
    a "{cps=20}อยู่ๆ ฝนก็ดันตกแบบนี้ จะกลับบ้านยังไงดีฟะเนี่ย ไม่ได้เอาร่มมาซะด้วยสิ{cps=-1}"
    show งง with Dissolve(1.0)
    play sound"78.mp3"
    e "{cps=20}ทั้ง ๆ ที่นายเป็นคนพูดเองว่า พยากรณ์อากาศวันนี้บอกว่าฝนจะตก ก็ยังไม่เอาร่มมาอีกเหรอว้าาา?{cps=-1}"
    play sound"79.mp3"
    a "{cps=20}ก็ไม่ได้คิดจะเชื่อตั้งแต่แรกเหมือนกันนี่หว่า...{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"80.mp3"
    e "{cps=20}เจริญจริงๆ งั้นเอางี้มะ ไปเล่นบาสฆ่าเวลากันป่ะ?{cps=-1}"
    play sound"81.mp3"
    a "{cps=20}เล่นบาสอย่างงั้นเหรอ??{cps=-1}"
    hide เอกพลปกติ
    show มีความสุข
    play sound"83.mp3"
    e "{cps=20}อืม ไปมะ?{cps=-1}"
    play sound"84.mp3"
    a "{cps=20}ไม่ล่ะ{cps=-1}"
    hide มีความสุข
    show งง
    play sound"85.mp3"
    e "{cps=20}อ้าว ไหงงั้นฟะ ก็ฝนมันตกแบบนี้ นายจะกลับยังไง? ร่มก็ไม่มีไม่ใช่เรอะ{cps=-1}"
    play sound"86.mp3"
    a "{cps=20}จะลองหาทางดูก็แล้วกัน{cps=-1}"
    hide งง
    show เอกพลปกติ
    play sound"87.mp3"
    e "{cps=20}เอางั้นเรอะ? ไม่เปลี่ยนใจแน่นะ?{cps=-1}"
    play sound"88.mp3"
    a "{cps=20}อืม ไม่เป็นไร นายไปเหอะ{cps=-1}"
    hide เอกพลปกติ
    show มีความสุข
    play sound"90.mp3"
    e "{cps=20}อือ ไว้เจอกันพรุ่งนี้ บายๆ{cps=-1}"
    play sound"91.mp3"
    a "{cps=20}อืม บาย{cps=-1}"
    hide มีความสุข with Dissolve(1.0)
    play sound"92.mp3"
    a "{cps=20}ทำไมมันตกแรงขึ้นกว่าเดิมอีกละเนี่ย... ทำไงดีหว่า...{cps=-1}"
    "{cps=20}เอาเป็นว่า ทิ้งหนังสือกับกระเป๋าไว้ที่นี่แล้วลุยฝนกลับเลยก็แล้วกัน{cps=-1}"
    "{cps=20}เสียงของสายฝนและฟ้าผ่า ดังสะท้านขึ้นอย่างน่ากลัว{cps=-1}"
    "{cps=20}ราวกับว่าพายุลูกใหญ่ กำลังถาโถมเข้าใส่โรงเรียนแห่งนี้อย่างเกรี้ยวกราด{cps=-1}"
    "{cps=20}หลังจากที่ผมเก็บของไวที่ห้องเรียนแล้ว\nก็เดินออกมาทางประตูหน้าตึกเรียนพลางคิดหาเส้นทางกลับบ้านยังไงให้ปลอดภัยที่สุด{cps=-1}"
    "{cps=20}แต่ดูเหมือนว่า ผมคงจะไม่ได้กลับเร็วๆนี้แน่{cps=-1}"
    "{cps=20}สองเท้าของผมย่ำลงบันไดไม้อย่างเชื่องช้า\nพาตัวเองมุงหน้าเดินไปยังหอประชุมที่อยู่ใกล้กับประตูโรงเรียนเพื่อหลบฝน{cps=-1}"
    "{cps=20}ท่ามกลางแสงสลัวของหอประชุม มีภาพของใครบางคนที่ยืนหลบฝนอยู่ด้านในเช่นเดียวกัน{cps=-1}"
    #เสียงเท้าเดิน
    play sound"93.mp3"
    "{cps=20}ร่างของเด็กสาวคนหนึ่งกำลังยืนมองสายฝนที่กระหน่ำลงมา ร่างของเด็กสาวสั่นเทาเล็กน้อย...{cps=-1}"
    "{cps=20}หรือว่าเธอจะกลัวเสียงฟ้าผ่า?{cps=-1}"
    "{cps=20}ผมสรุปเอาเองจากสิ่งที่เห็น ระหว่างที่ผมกำลังคิดอะไรไม่เข้าเรื่องอยู่นั้น{cps=-1}"
    "{cps=20}เสียงของสายฟ้า ได้ร้องคำรามขึ้นอีกหลายครั้ง ร่างเล็กๆ นั้นสั่นระริก\nสองมือเรียวงามกอดร่างเอาไว้ด้วยความหวาดกลัว...{cps=-1}"
    "{cps=20}ท่าจะไม่ได้การซะแล้ว ต้องทำอะไรสักอย่าง... แล้ว... จะทำอะไรดีล่ะ...?{cps=-1}"
    "{cps=20}อา... ช่างงี่เง่าเสียจริง ตัวผม... คิดเข้าสิ ว่าในเวลาแบบนี้ ควรจะทำอะไรกันแน่!!{cps=-1}"
    menu:
        "กระโดดกอดเลยดีมั้ย?":
            jump iwant1
        "คิดดูให้ดีๆ อีกครั้งสิฟะ!!":
            jump intwant2
label iwant1:
    "{cps=20}กระโดดกอดเลยดีมั้ย{cps=-1}"
    play sound"94.mp3"
    a "{cps=20}หาที่ตายโดยใช่เหตุแล้วไหมล่ะ ไม่ดีๆ{cps=-1}"
    jump afterrain
label intwant2:
    "{cps=20}คิดดูให้ดีๆ อีกครั้งสิฟะ!!{cps=-1}"
    a "{cps=20}มันต้องมีทางออกดีๆ สิน่า!!{cps=-1}"

label afterrain:
    "{cps=20}ผมพยายามเค้นสมองคิดอยู่ครู่หนึ่ง จู่ๆ ก็นึกอะไรบางอย่างขึ้นมาได้...{cps=-1}"
    play sound"95.mp3"
    e "{cps=20}ถ้าในเวลาที่เรากำลังหวาดกลัวอะไรบางอย่างแล้วละก็...ถ้ามีใครสักคนหนึ่งคอยอยู่เป็นเพื่อนเรา\nก็ท่าจะดีนะ{cps=-1}"
    "{cps=20}เสียงของเจ้าเอกดังแว่วขึ้นมาภายในหัวของผม{cps=-1}"
    "{cps=20}ไม่นึกว่าเรื่องที่คุยกับมันเรื่อยเปื่อยเมื่อช่วงพักกลางวัน\nจะมามีประโยชน์เอาตอนนี้แฮะ{cps=-1}"
    "{cps=20}ถ้าไปชวนคุยล่ะก็ น่าจะทำให้เธอหายกลัวได้บ้างก็ดีนะ...{cps=-1}"
    play sound"96.mp3"
    a "{cps=20}เอาล่ะ ลุยเลยก็แล้วกัน!{cps=-1}"
    "{cps=20}ผมบอกตัวเองแบบนั้นแล้วก้าวขาออกไปทันที{cps=-1}"
    play sound"97.mp3"
    a "{cps=20}เฮ้ออ... ตกหนักขนาดนี้ กว่าจะกลับไปถึงบ้าน มีหวังเปียกไปถึงลำใส้ใหญ่แหงๆเลย{cps=-1}"
    "{cps=20}ผมพูดออกไปด้วยน้ำเสียงที่ดังพอจะทำให้เด็กสาวที่กำลังยืนตัวสั่นอยู่นั้น{cps=-1}"
    "{cps=20}ค่อยๆแหงนหน้าขึ้นมามองผมด้วยสีหน้าสงสัย อ้ะ!{cps=-1}"
    "{cps=20}นี่มัน... เด็กผู้หญิงที่ยืนอยู่หน้าโรงเรียนเมื่อเช้านี้นี่หว่า!!{cps=-1}"
    play sound"98.mp3"
    a "เอาไงดีละเนี่ย ถ้าวิ่งฝ่าไปมีหวังได้หวัดกินแน่ๆ เลย...{cps=-1}"
    "{cps=20}ผมพูดต่อพลางหันไปยิ้มให้เธอเล็กน้อย{cps=-1}"
    "{cps=20}เธอคนนั้นมองหน้าผมอยู่ครู่หนึ่งก่อนที่จะแสดงรอยยิ้มบางๆออกมา{cps=-1}"
    "{cps=20}อ๊ากกก!! น่ารักโครตๆ เลยว่ะครับ!!{cps=-1}"
    show อริสายิ้ม with Dissolve(1.0)
    play sound"99.mp3"
    b "{cps=20}นั่นสินะคะ ตกหนักขนาดนี้ ถ้าขืนวิ่งฝ่าไปต้องเป็นหวัดแน่ๆเลยค่ะ{cps=-1}"
    play sound"100.mp3"
    a "{cps=20}ของมันแน่อยู่แล้ว ถ้าขืนตากฝนจะเป็นหวัดตั้งแต่เปิดเทอมแบบนี้\nมีหวังโดนหาว่าเป็นไอ้บ้าแน่นอนเลยล่ะ...{cps=-1}"
    "{cps=20}ผมพูดค้างไว้แค่นั้น จู่ๆ เธอคนนั้นก็ขยับตัวเข้ามาใกล้ผม{cps=-1}"
    "{cps=20}ในที่สุด เราทั้งสองคนก็ยืนอยู่ใกล้กันจนแทบจะชนกันแล้ว{cps=-1}"
    play sound"101.mp3"
    b "{cps=20}คิกๆ ตกใจอะไรกันคะ{cps=-1}"
    play sound"102.mp3"
    a "{cps=20}ยะ เย้ย!?{cps=-1}"
    stop music fadeout 1.0
    play music"Justyou.mp3"
    hide อริสายิ้ม
    show อริสาปกติ
    play sound"103.mp3"
    b "{cps=20}การที่คุณร้องเสียงหลงออกมาแบบนั้น ต่อหน้าผู้หญิงที่ยังไม่รู้จักกัน ถือว่าเสียมารยาทนะคะ{cps=-1}"
    play sound"104.mp3"
    a "{cps=20}หา!?{cps=-1}"
    play sound"105.mp3"
    b "{cps=20}มันดูเหมือนว่า...คุณรังเกียจ จนต้องร้องอุทานออกมายังไงยังงั้นเลยน่ะค่ะ...{cps=-1}"
    play sound"106.mp3"
    a "{cps=20}ปะ เปล่านะครับ ไม่ได้หมายถึงแบบนั้นนะครับ!{cps=-1}"
    hide อริสาปกติ
    show อริสาหลับตายิ้ม
    play sound"107.mp3"
    b "{cps=20}โชคดีที่อลิสไม่ได้คิดมากเท่าไหร่ แต่ทางที่ดีอย่าไปทำแบบนี้กับใครเขาอีกนะคะ{cps=-1}"
    play sound"108.mp3"
    a "{cps=20}ขะ ขอโทษครับ...{cps=-1}"
    hide อริสาหลับตายิ้ม
    show อริสาหลับตายิ้มv1
    play sound"109.mp3"
    b "{cps=20}คิกๆ คุณนี่ ตลกจังเลยนะคะ{cps=-1}"
    play sound"110.mp3"
    a "{cps=20}ขะ ขอบคุณครับ...{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อริสาปกติ
    play sound"111.mp3"
    b "{cps=20}แต่ว่าจะดีกว่านี้ ถ้าเลิกพูดคำว่า ขอโทษ หรือ ขอบคุณ โดยที่ไม่จำเป็นอีกน่ะค่ะ{cps=-1}"
    play sound"112.mp3"
    a "{cps=20}ขอโทษด้วยครับ อ้ะ!{cps=-1}"
    play sound"113.mp3"
    b "{cps=20}อีกแล้วนะ{cps=-1}"
    play sound"114.mp3"
    a "{cps=20}อ่า... เอ่อ... ครับ{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อลิสาหลับตา
    play sound"115.mp3"
    b "{cps=20}วันนี้พยากรณ์อากาศเหมือนจะถูกนะเนี่ย{cps=-1}"
    play sound"116.mp3"
    a "{cps=20}ครับ?{cps=-1}"
    hide อลิสาหลับตา
    show อริสาปกติ
    play sound"117.mp3"
    b "{cps=20}ก็ที่เมื่อเช้า พยากรณ์อากาศบอกว่า วันนี้อาจจะมีฝนตกหนักไงล่ะคะ\nแบบนี้ก็กลับบ้านลำบากแย่เลยสินะคะเนี้ย{cps=-1}"
    play sound"116.mp3"
    a "{cps=20}ครับ...{cps=-1}"
    play sound"118.mp3"
    b "{cps=20}พูดเป็นแค่คำว่า ครับ คำเดียวหรือคะ?{cps=-1}"
    play sound"119.mp3"
    a "{cps=20}ครับ เอ้ย!! ไม่ใช่ครับ{cps=-1}"
    play sound"120.mp3"
    b "{cps=20}โธ่...อุตส่าได้พบกันอีกครั้งทั้งที แอบผิดหวังเหมือนกันนะเนี้ย{cps=-1}"
    "{cps=20}หา...? ผิดหวัง ผิดหวังเรื่องอะไรฟะ...{cps=-1}"
    play sound"121.mp3"
    a "{cps=20}เราเคยรู้จักกันมาก่อนหรือเปล่าครับ?{cps=-1}"
    "{cps=20}ผมเอ่ยถามออกไปด้วยความสงสัย{cps=-1}"
    hide อริสาปกติ
    show อริสาหลับตายิ้มv1
    play sound"122.mp3"
    b "{cps=20}ไม่นี่คะ{cps=-1}"
    play sound"123.mp3"
    a "{cps=20}ง่ะ... แล้วที่บอกว่าพบกันอีกครั้งนี่คือ?{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อริสาหลับตายิ้ม
    play sound"124.mp3"
    b "{cps=20}เมื่อวานวันเปิดภาคเรียน ก็ได้พบกันแล้วนี่คะ{cps=-1}"
    play sound"125.mp3"
    a "{cps=20}แต่ว่า... เรายังไม่รู้จักกันเลยนะครับ{cps=-1}"
    hide อริสาหลับตายิ้ม
    show อริสาหลับตายิ้มv1
    play sound"126.mp3"
    o "{cps=20}ชื่อ อลิสา ค่ะ{cps=-1}"
    play sound"127.mp3"
    a "{cps=20}หา...!?{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อริสาปกติ
    play sound"128.mp3"
    o "{cps=20}ที่นี้เราก็รู้จกันแล้วนะคะ คุณ... เอ่อ...{cps=-1}"
    play sound"129.mp3"
    a "{cps=20}กะ กรินทร์ครับ เรียกว่ารินก็ได้ครับ{cps=-1}"
    hide อริสาปกติ
    show อริสาหลับตายิ้ม
    play sound"130.mp3"
    o "{cps=20}ค่ะ ริน ยินดีที่ได้รู้จักค่ะ{cps=-1}"
    play sound"131.mp3"
    a "{cps=20}เช่นกันครับ อลิสา{cps=-1}"
    hide อริสาหลับตายิ้ม
    show อริสาหลับตายิ้มv1
    play sound"132.mp3"
    o "{cps=20}เรียกอลิสก็ได้ค่ะ ง่ายดี แถมดูเป็นกันเองมากกว่าด้วย{cps=-1}"
    "{cps=20}ภาพของเธอที่กำลังยิ้มให้ผมนั้น ทำเอาผมเผลอหน้าแดงโดยไม่รู้ตัว คนอะไรน่ารักเป็นบ้าเลยว้อยย{cps=-1}"
    "{cps=20}ระหว่างที่ผมกำลังมองเธออยู่นั้น จู่ๆ ก็มีรถยนต์สีขาวคันหนึ่งแล่นมาจอดที่หน้าประตูตึกเรียน{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อริสาหลับตายิ้ม
    play sound"134.mp3"
    o "{cps=20}อ้ะ! รถของที่บ้านมารับแล้วค่ะ ขอตัวก่อนนะคะ{cps=-1}"
    play sound"116.mp3"
    a "{cps=20}ครับ...{cps=-1}"
    play sound"135.mp3"
    o "{cps=20}แล้วก็... ขอบคุณที่มาอยู่คุยเป็นเพื่อนค่ะ{cps=-1}"
    play sound"136.mp3"
    a "{cps=20}ไม่เป็นไรครับ... เอ๊ะ!?{cps=-1}"
    hide อริสาหลับตายิ้มv1
    show อลิสาเขิน
    play sound"137.mp3"
    o "{cps=20}คิกๆ ใจดีจังเลยนะคะ ถึงแม้ว่าจะไม่เนียนเท่าไหร่ แต่ก็ขอบคุณจริงๆ ค่ะ{cps=-1}"
    "{cps=20}หวา... ถูกชมตรงๆ แบบนี้ ชักจะเขินแฮะ{cps=-1}"
    hide อลิสาเขิน
    show อริสาหลับตายิ้ม
    play sound"139.mp3"
    o "{cps=20}ขอตัวก่อนนะคะ แล้วพบกันใหม่พรุ้งนี้ค่ะ{cps=-1}"
    play sound"140.mp3"
    a "{cps=20}อ๊ะ!!{cps=-1}"
    hide อริสาหลับตายิ้ม
    "{cps=20}อลิสตอบผมพร้อมกับขยิบตาให้ผมเล็กน้อย จากนั้นเธอก็รีบวิ่งไปที่รถทันที{cps=-1}"
    "{cps=20}วันนี้นับเป็นวันที่โชคดีของเราจริงๆ{cps=-1}"
    "{cps=20}ณ เวลานี้ ผมได้แต่ยืรมองรถสีขาว แล่นออกไปจากหน้าประตูตึกเรียนด้วยหัวใจที่พองโต{cps=-1}"
    "{cps=20}ท่ามกลางสายฝนที่ยังคงกระหน่ำลงมาไม่หยุด...{cps=-1}"